/* Note:Your choice is C IDE */
#include "stdio.h"
void main()
{
	int i, j;
	/**
	i=1，i<=9成立，进入外层循环
	j=1,j<=1成立，进入内层循环，输出j*i => 1*1=1
	接着判断内层循环条件表达式，不成立，结束内层循环，到外层循环，执行换行语句
	然后外层循环执行增量表达式，再判断外层循环条件表达式，2 <= 9,成立，进入外层循环，
	
	j=1, j<=2成立，进入内层循环，输出j*i => 1*2=2;，j++
	接着判断内层循环 2 <= 2成立，进入内层特，输出i*j => 2*2=4 j++
	判断内层循环3 <= 2不成立，结束内层循环，到外层循环，执行换行语句
	
	i=3 i<=9成立，进入外层循环
	j=1 1<=3成立，进入内层循环，输出1*3；j++;
	j=2 2<=3					    2*3； j++;
	j=3 3<=3						3*3；j++;
	j=4 4<=3 不成立 结束内层循环 执行换行，
	
	*/
    for(i = 1; i <= 9; i++) {
    	for(j = 1; j <= i; j++) {
    		printf("%d*%d=%d  ", j, i, j * i);
    	}
    	printf("\n");
    }
}