#include "stdio.h"
void main()
{
    int a = 10, b = 10, c = 5, d = 0;
    printf("a == b && a == c: %d\n", a == b && a == c); // &&表示与操作，即所有条件都成立，整体表达式才成立，只要有一个条件不成立，则整个表达式就不成立
    // printf("a == b & a == c: %d\n", a == b & a == c); &也是表示与操作，&&只要最先判断到有一个条件不成立，则整个表达式就不成立，&每个表达式都会判断
	printf("a == b || a == c: %d\n", a == b || a == c); // ||表示或操作，只要其中一个条件成立，则整个表达式成立。最先判断到一个条件成立，则整个表达式就成立，后面的条件不去判断了    | 每个条件都会去判断
	printf("!a: %d\n", !a);// a = 10, 非0即真，a表示真，!a即非真，所以最终结果是假，输出0
	printf("!d: %d\n", !d);
	
	printf("a == b && a == c && a == d: %d\n", a == b && a == c && a == d);
	
	printf("!a && !b: %d\n", !a && !b);
	printf("!a || !d: %d\n", !a || !d);
	
	printf("!a || !d && a == c || a == b: %d\n", !a || !d && a == c || a == b);
}