/* Note:Your choice is C IDE */
#include "stdio.h"
void main()
{
    int a[3][4] = {
    		{0, 1, 2},
    		{3},
    		{4, 5, 6, 7}
    };
    int i, j;
    
    int b[5][10];
    
    int c[][5] = {
    		{1, 2, 3},
    		{1}
    }; // 进行了初始化，初始化时指定了行数，此时不会出错
    // int c[][5]; 如果这里只进行声明，未告诉有多少行，则错误
    // int d[5][]; 错误的，未声明有多少列
    
    a[2][2] = 10; // 单独给某个元素赋值， 数组名[行下标][列下标] = 值
    
    printf("a[0][2] = %d, a[2][0] = %d\n", a[0][2], a[2][0]);
    
    for(i = 0; i < 3; i++) { // 对行进行循环
    	for(j = 0; j < 4; j++) {// 对列进行循环
    		printf("a[%d][%d] = %d\t", i, j, a[i][j]);
    	}
    	printf("\n");
    }
    
    printf("b[5][10]:\n");
    
    for(i = 0; i < 5; i++) {
    	for(j = 0; j < 10; j++) {
    		b[i][j] = i + j; // 每个元素都赋值为10
    		printf("b[%d][%d]=%d  ", i, j, b[i][j]);
    	}
    	printf("\n");
    }
    
    b[6][12] = 100;
    printf("%d", b[6][12]); // 二维数组在这里没有越界，但是值是不确定的
}