/* Note:Your choice is C IDE */
#include "stdio.h"
void main()
{
    int pao = 0;
    int i = 1;
    /**
    开始做：
    400 * 1 =》 pao = 400;
    再执行增量操作i++ => i = 2;
    再进行条件表达式的判断，400 < 1200 ?,条件成立，则继续循环
    400 * 2 =》 pao = 800；
    再执行增量操作i++ => i = 3;
    再进行条件表达式的判断，800 < 1200 ?，条件成立，继续循环
    400 * 3 => pao = 1200;
    再执行增量操作i++ => i = 4;
    再进行条件表达式的判断，1200 < 1200?，条件不成立，结果为假，循环结束
    
    do {
    	循环语句体；
    	增量操作；
    } while(条件表达式);
    
    */
    do {
    	pao = 400 * i;
    	i++;
    } while(pao < 1200);
    printf("跑完%d米\n", pao);
}